{"0":{"url":"https:\/\/www.foodnetwork.com\/topics\/alfredo","title":"'Alfredo Recipes : Food Network | Food Network'","content":"\"Alfredo Recipes : Food Network | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Topics Alfredo Recipes The perfect comfort food, find easy Alfredo recipes and cooking techniques from the chefs at Food Network. Pinterest Facebook Twitter Email Shrimp Fettuccine Alfredo Chicken Fettuccine Alfredo Alfredo Sauce All Alfredo Recipes Ideas Showing 1-18 of 78 Alfredo Sauce Recipe | Courtesy of Ree Drummond Total Time: 10 minutes 162 Reviews Ree's Pasta-Bar Alfredo Sauce Video | 01:35 Ree includes creamy Alfredo Sauce on daughter Alex's birthday pasta bar. Alfredo Shrimp Scampi Dump Video | 00:52 The Alfredo Shrimp Scampi Dump will have everyone begging for seconds! Chicken Fettuccine Alfredo Recipe | Courtesy of Food Network Kitchen Total Time: 25 minutes 99 Reviews Fettuccine Alfredo Recipe | Courtesy of Ree Drummond Total Time: 20 minutes 22 Reviews Shrimp Fettuccine Alfredo Recipe | Courtesy of Food Network Kitchen Total Time: 25 minutes 56 Reviews Ravioli and Spinach Alfredo Video | 01:18 Ravioli and spinach are baked in a cheesy Alfredo for a decadent entree. Butternut Squash Alfredo Pasta Video | 00:55 Butternut squash lends its creaminess to this light pasta dish. The Best Alfredo Sauce to Buy in a Jar Article Which sauce is actually worth grabbing off the shelf? Chicken Fettuccine Alfredo Video | 04:26 Valerie's nephew helps her make homemade fettuccine noodles for this dish. Chicken Fettuccine Alfredo Recipe | Courtesy of Trisha Yearwood Total Time: 30 minutes 32 Reviews Cauliflower Alfredo Sauce Recipe | Courtesy of Katie Lee Total Time: 45 minutes 25 Reviews Chicken and Broccoli Fettuccine Alfredo with Homemade Fettuccine Recipe | Courtesy of Valerie Bertinelli Total Time: 3 hours 40 minutes 6 Reviews Spaghetti Squash Alfredo Video | 00:55 Lighten up a hearty favorite with this healthy spaghetti squash recipe. Low-Cal Fettuccine Alfredo Recipe | Courtesy of Food Network Kitchen Total Time: 25 minutes 176 Reviews Learn How to Make Spring Vegetable Fettuccine Alfredo Video | 00:56 Looking for an easy vegetarian pasta dish? Spring vegetables brighten up this classic fettuccine Alfredo recipe. Ingredients you'll need to make it include, fettuccine pasta, shiitake mushrooms, asparagus, frozen peas, Parmigiano-Reggiano cheese, chives and lemon zest. Spaghetti Squash Alfredo with Pancetta and Peas Recipe | Courtesy of Food Network Kitchen Total Time: 40 minutes 19 Reviews Cajun Chicken Alfredo 2 Recipe | Courtesy of Guy Fieri Total Time: 45 minutes 121 Reviews Previous 1 2 3 4 5 Next What's Cooking Our 10 Most-Popular Recipes Right Now 10 Photos More Recipes Recipe of the Day To sign up, please enable JavaScript. Don't miss the latest recipes delivered to your inbox daily. Privacy Policy Sign Up Food Network News Healthy Eating Food Network What to Watch Food Network Favorites Food Network Where to Eat Food Network Shopping 12 Days of Cookies Thanksgiving Countdown Sign Up for More No Thanks Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email \""},"8":{"url":"https:\/\/www.foodnetwork.com\/recipes\/geoffrey-zakarian\/fettuccine-alfredo-2726234","title":"'Fettuccine Alfredo Recipe | Geoffrey Zakarian | Food Network'","content":"\"Fettuccine Alfredo Recipe | Geoffrey Zakarian | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Recipes Geoffrey Zakarian Prev Recipe Next Recipe WATCH WATCH Loading Video... See more (12) Fettuccine Alfredo Recipe courtesy of Geoffrey Zakarian Recipe courtesy of Geoffrey Zakarian Show: The Kitchen Episode: Winter Fix Fettuccine Alfredo Getting reviews... Save Recipe Level: Easy Total: 30 min Active: 30 min Yield: 4 servings Share This Recipe Pinterest Facebook Twitter Email Level: Easy Total: 30 min Active: 30 min Yield: 4 servings Ingredients Bechamel: 4 tablespoons butter 5 tablespoons all-purpose flour\\xa0 1\/4 teaspoon ground cloves Pinch grated nutmeg\\xa0 2 1\/2 cups whole milk, warmed Kosher salt and freshly ground black pepper Fettuccine Alfredo: Kosher salt and freshly ground black pepper 12 ounces dried fettuccine\\xa0 2 tablespoons olive oil\\xa0 1\/2 cup thinly sliced shallots\\xa0 2 cloves garlic, finely minced\\xa0 1\/2 cup grated Parmigiano-Reggiano\\xa0 1\/2 cup grated Pecorino Romano cheese 1\/4 cup finely minced fresh parsley Directions WATCH Watch how to make this recipe. For the bechamel: In a medium saucepan, melt the butter over medium flame. Add the flour and whisk until the texture of wet sand is achieved. Lower the heat to low, add the cloves and nutmeg and cook for 2 minutes. Slowly whisk in the whole milk and bring the sauce to a simmer. Cook for 3 minutes, season with salt and pepper and set aside. For the fettuccine alfredo: Bring a large pot of water to a boil and season with salt. Add the pasta and begin to cook. Meanwhile, in a large saute pan, heat the olive oil over medium heat. Cook the shallots and garlic until soft, about 4 minutes. Add the bechamel sauce, along with 1 cup of the pasta water. When the pasta is 80 percent cooked, add it to the saute pan and simmer until the sauce is thickened and the pasta is al dente. Toss with the cheeses and parsley, and season with salt and pepper. My Private Notes Add a Note WATCH Show: The Kitchen Episode: Winter Fix Categories: Alfredo Main Dish Vegetarian More from: The Kitchen Looking for Something Else? Quick & Easy More Cheese Recipes 5 Ingredients or Less Highly Rated Chicken Fettuccine Alfredo Shrimp Fettuccine Alfredo Fettuccine Alfredo Fettuccine Alfredo Chicken Fettuccine Alfredo Low-Cal Fettuccine Alfredo Spring Vegetable Fettuccine Alfredo Chicken Alfredo Stuffed Shells Get the Food Network Kitchen App 👩\\u200d🍳 What's Cooking Healthy Dinners — Fast! Top Cauliflower Recipes 60+ Spring Dinners Discover More Recipes... Let's Get Cooking! To sign up, please enable JavaScript. Sign up for the Recipe of the Day newsletter to receive editor-picked recipes, tips and videos delivered to your inbox daily. Privacy Policy Sign Up Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email \""},"10":{"url":"https:\/\/www.foodnetwork.com\/recipes\/giada-de-laurentiis\/fettuccine-alfredo-recipe-1942555","title":"'Fettuccine Alfredo Recipe | Giada De Laurentiis | Food Network'","content":"'Fettuccine Alfredo Recipe | Giada De Laurentiis | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Recipes Giada De Laurentiis Prev Recipe Next Recipe WATCH WATCH Loading Video... First Up 04:28 First Up Giada De Laurentiis’ Fettuccine Alfredo 04:28 Want to learn the secret to Giada De Laurentiis’ fettuccine alfredo? Look no further. In this short Every Day Italian video, Giada reveals that low and slow cooking is the secret to this perfect pasta dish. She shows how to make this rich velvety sauce infused with fresh ingredients while avoiding curdling. Now Playing 01:27 Now Playing How to Cook Italian Pasta 01:27 Try our basic technique to cook perfect \"al dente\" pasta. Now Playing 01:31 Now Playing How to Zest Citrus 01:31 Citrus zest is a great flavor booster. Here are several zesting techniques. See more (12) Fettuccine Alfredo Recipe courtesy of Giada De Laurentiis Recipe courtesy of Giada De Laurentiis Show: Everyday Italian Episode: Italian Restaurant Classics Fettuccine Alfredo Getting reviews... Save Recipe Level: Easy Total: 20 min Active: 20 min Yield: 6 to 8 servings Share This Recipe Pinterest Facebook Twitter Email Level: Easy Total: 20 min Active: 20 min Yield: 6 to 8 servings Ingredients 18 ounces fresh fettuccine 2 1\/2 cups heavy cream 1\/2 cup fresh lemon juice 12 tablespoons unsalted butter 2 cups grated Parmesan 2 teaspoons grated lemon zest Pinch freshly grated nutmeg Salt and freshly ground white pepper Directions WATCH Watch how to make this recipe. Cook the pasta in a large pot of boiling salted water until tender but still firm to the bite, stirring occasionally, about 4 minutes. Drain. Stir 2 cups of the cream and the lemon juice in a heavy large skillet to blend. Add the butter and cook over medium heat just until the butter melts, stirring occasionally, about 3 minutes. Remove from the heat. Add the pasta and toss. Add the remaining 1\/2 cup of cream, and Parmesan to the cream sauce in the skillet. Add the lemon zest, nutmeg, salt, and white pepper. Toss the pasta mixture over low heat until the sauce thickens slightly, about 1 minute. My Private Notes Add a Note WATCH Show: Everyday Italian Episode: Italian Restaurant Classics Categories: Healthy Vegetarian Italian Alfredo Pasta Recipes Dairy Recipes Main Dish Appetizer Recipes for a Crowd More from: Easy Comfort Food Recipes Looking for Something Else? Quick & Easy More Cheese Recipes 5 Ingredients or Less Highly Rated Chicken Fettuccine Alfredo Fettuccine Alfredo Shrimp Fettuccine Alfredo Chicken Fettuccine Alfredo Low-Cal Fettuccine Alfredo Spring Vegetable Fettuccine Alfredo Chicken and Broccoli Fettuccine Alfredo with Homemade Fettuccine Alfredo Sauce Get the Food Network Kitchen App 👩\\u200d🍳 What\\'s Cooking Healthy Dinners — Fast! Top Cauliflower Recipes 50 Winter Meals Discover More Recipes... Let\\'s Get Cooking! To sign up, please enable JavaScript. Sign up for the Recipe of the Day newsletter to receive editor-picked recipes, tips and videos delivered to your inbox daily. Privacy Policy Sign Up Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email '"},"12":{"url":"https:\/\/www.foodnetwork.com\/recipes\/giada-de-laurentiis\/fettuccine-alfredo-recipe-1942555.amp","title":"'Fettuccine Alfredo Recipe | Giada De Laurentiis | Food Network'","content":"\"Fettuccine Alfredo Recipe | Giada De Laurentiis | Food Network Watch Full Seasons Recipes Shows Chefs Restaurants Videos Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z © 2020 Television Food Network, G.P. All rights reserved. Prev Recipe Next Recipe WATCH Recipe courtesy of Giada De Laurentiis Fettuccine Alfredo 581\\xa0Reviews Level: Easy Yield: 6 to 8 servings Total: 20 min Active: 20 min Advertisement Ingredients 18 ounces fresh fettuccine 2 1\/2 cups heavy cream 1\/2 cup fresh lemon juice 12 tablespoons unsalted butter 2 cups grated Parmesan 2 teaspoons grated lemon zest Pinch freshly grated nutmeg Salt and freshly ground white pepper Directions WATCH Watch how to make this recipe. Cook the pasta in a large pot of boiling salted water until tender but still firm to the bite, stirring occasionally, about 4 minutes. Drain. Stir 2 cups of the cream and the lemon juice in a heavy large skillet to blend. Add the butter and cook over medium heat just until the butter melts, stirring occasionally, about 3 minutes. Remove from the heat. Add the pasta and toss. Add the remaining 1\/2 cup of cream, and Parmesan to the cream sauce in the skillet. Add the lemon zest, nutmeg, salt, and white pepper. Toss the pasta mixture over low heat until the sauce thickens slightly, about 1 minute. Show More WATCH Show: Everyday Italian Episode: Italian Restaurant Classics Categories: Healthy Vegetarian Italian Alfredo Pasta Recipes Dairy Recipes Main Dish Appetizer Recipes for a Crowd More from: Easy Comfort Food Recipes Let's Get Cooking! Sign up for the Recipe of the Day newsletter to receive editor-picked recipes,tips and videos delivered to your inbox daily. Privacy Policy Thanks for subscribing to the Recipe of the Day newsletter. Check out all our other great newsletters from Easy Recipes, Healthy Eating Ideas and Chef Recipe Videos. We're sorry, there was an error signing you up. Please try again later. Looking for Something Else? Chicken Fettuccine Alfredo (99) Shrimp Fettuccine Alfredo (56) Fettuccine Alfredo (22) Chicken Fettuccine Alfredo (32) Low-Cal Fettuccine Alfredo (176) Spring Vegetable Fettuccine Alfredo (15) Chicken and Broccoli Fettuccine Alfredo with Homemade Fettuccine (6) Alfredo Sauce (162) Advertisement 581\\xa0Reviews Anonymous The sauce is delicious ! I would reduce the cream to 2 cups and not 2 and a half because it was a little runny and also reduce the butter by 3 tablespoons. But great flavor! See All Reviews Add Your Review AdChoices Privacy Newsroom © 2020 Television Food Network, G.P. All rights reserved. Top \\u2002\\u2002 \\u2002\\u2002 \""},"14":{"url":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/chicken-fettuccine-alfredo-3364118","title":"'Chicken Fettuccine Alfredo Recipe | Food Network Kitchen | Food Network'","content":"\"Chicken Fettuccine Alfredo Recipe | Food Network Kitchen | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Recipes Prev Recipe Next Recipe Chicken Fettuccine Alfredo Recipe courtesy of Food Network Kitchen Recipe courtesy of Food Network Kitchen Watch how to make this recipe. Chicken Fettuccine Alfredo Getting reviews... Classic and easy to make, this version of Alfredo doesn't use flour to thicken the sauce. Instead, it relies on a slight simmer and a heavy dose of cheese. Save Recipe Level: Easy Total: 25 min Active: 25 min Yield: 4 servings Share This Recipe Pinterest Facebook Twitter Email Level: Easy Total: 25 min Active: 25 min Yield: 4 servings Ingredients Kosher salt and freshly ground black pepper 12 ounces fettuccine Olive oil, for tossing 12 ounces boneless, skinless chicken breast (about 2)\\xa0 1 stick (8 tablespoons) unsalted butter 2 cups heavy cream 2 pinches freshly grated nutmeg 1 1\/2 cups freshly grated Parmigiano-Reggiano\\xa0 Directions Bring a large pot of water to a boil, and salt generously. Add the pasta and cook according to package directions until al dente, tender but still slightly firm. Strain, and toss with a splash of oil. Meanwhile, slice the chicken into 1\/4-inch-thick strips, and lay them on a plate or a sheet of waxed paper. Season with salt and pepper. Heat a large skillet over medium heat, and add 2 tablespoons of the butter. When the butter melts, raise the heat to medium-high and add the chicken in 1 layer. Cook, without moving the pieces, until the underside has browned, 1 to 2 minutes. Flip the pieces, and cook until browned and fully cooked through, 2 to 3 minutes more. Transfer the chicken to a medium bowl. Reduce the heat to medium, and add the remaining 6 tablespoons butter. Scrape the bottom of the skillet with a wooden spoon to release any browned bits. When the butter has mostly melted, whisk in the cream and nutmeg and bring to a simmer, then cook for 2 minutes. Lower the heat to keep the sauce just warm. Whisk the Parmigiano-Reggiano into the sauce. Add the chicken and cooked pasta, and toss well. Season with salt and pepper. Serve hot in heated bowls. Cook’s Note Don't worry if it seems like there is too much sauce. As soon as everything is tossed together, the sauce will start to cling to the pasta and thicken before your eyes! Copyright 2015 Television Food Network, G.P. All rights reserved. My Private Notes Add a Note Categories: Pasta Recipes Alfredo Chicken Recipes Poultry Main Dish More from: Easy Comfort Food Recipes Looking for Something Else? Quick & Easy More Fettucine Recipes 5 Ingredients or Less Highly Rated Chicken Fettuccine Alfredo Chicken and Broccoli Fettuccine Alfredo with Homemade Fettuccine Shrimp Fettuccine Alfredo Cajun Chicken Alfredo Low-Cal Fettuccine Alfredo Alfredo Shrimp Scampi Dump Dinner Bow-Tie Skillet Alfredo Spring Vegetable Fettuccine Alfredo Get the Food Network Kitchen App 👩\\u200d🍳 What's Cooking Healthy Dinners — Fast! Top Cauliflower Recipes 50 Winter Meals Discover More Recipes... Let's Get Cooking! To sign up, please enable JavaScript. Sign up for the Recipe of the Day newsletter to receive editor-picked recipes, tips and videos delivered to your inbox daily. Privacy Policy Sign Up Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email \""},"16":{"url":"https:\/\/www.foodnetwork.com\/recipes\/ree-drummond\/alfredo-sauce-2165760","title":"'Alfredo Sauce Recipe | Ree Drummond | Food Network'","content":"\"Alfredo Sauce Recipe | Ree Drummond | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Recipes Ree Drummond Prev Recipe Next Recipe WATCH WATCH Loading Video... See more (12) Alfredo Sauce Recipe courtesy of Ree Drummond Recipe courtesy of Ree Drummond Show: The Pioneer Woman Episode: Alex's 16th Birthday Alfredo Sauce Getting reviews... Save Recipe Level: Easy Total: 10 min Active: 10 min Yield: about 2 cups Share This Recipe Pinterest Facebook Twitter Email Level: Easy Total: 10 min Active: 10 min Yield: about 2 cups Ingredients 1 stick butter 1 cup heavy cream\\xa0\\xa0 Salt and freshly ground black pepper\\xa0 2 cups freshly grated Parmesan Pasta cooking water, as needed Directions WATCH Watch how to make this recipe. In a saucepan or skillet, warm the butter and cream. Season with salt and pepper. Add the Parmesan and stir until melted. Toss to combine, thinning with pasta water if necessary. My Private Notes Add a Note WATCH Show: The Pioneer Woman Episode: Alex's 16th Birthday Categories: Alfredo Parmesan Cheese Recipes More from: Fall Weeknight Dinners Looking for Something Else? Quick & Easy Highly Rated Healthy Surprise Me Cauliflower Alfredo Sauce No-Cream Alfredo Sauce Fettuccine Alfredo 5-Ingredient Instant Pot Mac and Cheese Cajun Chicken Alfredo Bow-Tie Skillet Alfredo Chicken Alfredo Stuffed Shells Marinara Sauce Get the Food Network Kitchen App 👩\\u200d🍳 What's Cooking Healthy Dinners — Fast! Top Cauliflower Recipes 60+ Spring Dinners Discover More Recipes... Let's Get Cooking! To sign up, please enable JavaScript. Sign up for the Recipe of the Day newsletter to receive editor-picked recipes, tips and videos delivered to your inbox daily. Privacy Policy Sign Up Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email \""},"19":{"url":"https:\/\/www.foodnetwork.com\/recipes\/trisha-yearwood\/chicken-fettuccine-alfredo-3239799","title":"'Chicken Fettuccine Alfredo Recipe | Trisha Yearwood | Food Network'","content":"\"Chicken Fettuccine Alfredo Recipe | Trisha Yearwood | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Recipes Trisha Yearwood Prev Recipe Next Recipe WATCH WATCH Loading Video... See more (12) Chicken Fettuccine Alfredo Recipe courtesy of Trisha Yearwood Recipe courtesy of Trisha Yearwood Show: Trisha's Southern Kitchen Episode: Trisha's Birthday Chicken Fettuccine Alfredo Getting reviews... Save Recipe Level: Easy Total: 30 min Active: 30 min Yield: 4 to 6 servings Share This Recipe Pinterest Facebook Twitter Email Level: Easy Total: 30 min Active: 30 min Yield: 4 to 6 servings Ingredients 1 pound fettuccine 1 pound boneless skinless chicken breasts, cut into 1-inch strips\\xa0 Salt and freshly ground black pepper\\xa0 1\/2 cup all-purpose flour\\xa0 1\/4 cup olive oil\\xa0 3 tablespoons salted butter\\xa0 2 cloves garlic, grated\\xa0 2 cups heavy cream\\xa0 2 cups grated Parmesan\\xa0 2 tablespoons finely chopped fresh parsley\\xa0 Directions WATCH Watch how to make this recipe. Bring a large pot of salted water to a boil. Add the pasta and cook according to the package instructions, about 8 minutes. Drain and set aside. Season the chicken with 1 teaspoon salt and some pepper. Dredge in the flour and shake off the excess. Heat the oil and butter in a large saucepan over medium-high heat until the butter melts. Carefully place the dredged chicken into pan. Add the grated garlic. Cook until the chicken is golden brown and cooked through, 4 to 6 minutes. Transfer to a plate and set aside. Pour the cream into the same pan and bring to a simmer. Stir in the Parmesan. Add the pasta to the mixture and toss to combine. Add the cooked chicken and gently toss. Garnish with the parsley and serve immediately. My Private Notes Add a Note WATCH Show: Trisha's Southern Kitchen Episode: Trisha's Birthday Categories: Alfredo Chicken Recipes Poultry Main Dish Looking for Something Else? Quick & Easy More Chicken Recipes 5 Ingredients or Less Highly Rated Chicken Fettuccine Alfredo Chicken and Broccoli Fettuccine Alfredo with Homemade Fettuccine Shrimp Fettuccine Alfredo Cajun Chicken Alfredo Low-Cal Fettuccine Alfredo Bow-Tie Skillet Alfredo Spring Vegetable Fettuccine Alfredo Chicken Spaghetti Get the Food Network Kitchen App 👩\\u200d🍳 What's Cooking Healthy Dinners — Fast! Top Cauliflower Recipes 60+ Spring Dinners Discover More Recipes... Let's Get Cooking! To sign up, please enable JavaScript. Sign up for the Recipe of the Day newsletter to receive editor-picked recipes, tips and videos delivered to your inbox daily. Privacy Policy Sign Up Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email \""},"20":{"url":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/chicken-fettuccine-alfredo-3364118.amp","title":"'Chicken Fettuccine Alfredo Recipe | Food Network Kitchen | Food Network'","content":"\"Chicken Fettuccine Alfredo Recipe | Food Network Kitchen | Food Network Watch Full Seasons Recipes Shows Chefs Restaurants Videos Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z © 2020 Television Food Network, G.P. All rights reserved. Prev Recipe Next Recipe Recipe courtesy of Food Network Kitchen Chicken Fettuccine Alfredo 109\\xa0Reviews Level: Easy Yield: 4 servings Total: 25 min Active: 25 min Advertisement Ingredients Kosher salt and freshly ground black pepper 12 ounces fettuccine Olive oil, for tossing 12 ounces boneless, skinless chicken breast (about 2)\\xa0 1 stick (8 tablespoons) unsalted butter 2 cups heavy cream 2 pinches freshly grated nutmeg 1 1\/2 cups freshly grated Parmigiano-Reggiano\\xa0 Directions Bring a large pot of water to a boil, and salt generously. Add the pasta and cook according to package directions until al dente, tender but still slightly firm. Strain, and toss with a splash of oil. Meanwhile, slice the chicken into 1\/4-inch-thick strips, and lay them on a plate or a sheet of waxed paper. Season with salt and pepper. Heat a large skillet over medium heat, and add 2 tablespoons of the butter. When the butter melts, raise the heat to medium-high and add the chicken in 1 layer. Cook, without moving the pieces, until the underside has browned, 1 to 2 minutes. Flip the pieces, and cook until browned and fully cooked through, 2 to 3 minutes more. Transfer the chicken to a medium bowl. Reduce the heat to medium, and add the remaining 6 tablespoons butter. Scrape the bottom of the skillet with a wooden spoon to release any browned bits. When the butter has mostly melted, whisk in the cream and nutmeg and bring to a simmer, then cook for 2 minutes. Lower the heat to keep the sauce just warm. Whisk the Parmigiano-Reggiano into the sauce. Add the chicken and cooked pasta, and toss well. Season with salt and pepper. Serve hot in heated bowls. Cook’s Note Don't worry if it seems like there is too much sauce. As soon as everything is tossed together, the sauce will start to cling to the pasta and thicken before your eyes! Copyright 2015 Television Food Network, G.P. All rights reserved. Show More Categories: Pasta Recipes Alfredo Chicken Recipes Poultry Main Dish More from: Easy Comfort Food Recipes Let's Get Cooking! Sign up for the Recipe of the Day newsletter to receive editor-picked recipes,tips and videos delivered to your inbox daily. Privacy Policy Thanks for subscribing to the Recipe of the Day newsletter. Check out all our other great newsletters from Easy Recipes, Healthy Eating Ideas and Chef Recipe Videos. We're sorry, there was an error signing you up. Please try again later. Looking for Something Else? Chicken Fettuccine Alfredo (32) Chicken and Broccoli Fettuccine Alfredo with Homemade Fettuccine (6) Shrimp Fettuccine Alfredo (56) Cajun Chicken Alfredo (413) Low-Cal Fettuccine Alfredo (176) Bow-Tie Skillet Alfredo (51) Alfredo Shrimp Scampi Dump Dinner (35) Spring Vegetable Fettuccine Alfredo (15) Advertisement 109\\xa0Reviews Anonymous This is amazing!<div><br \/><\/div> See All Reviews Add Your Review AdChoices Privacy Newsroom © 2020 Television Food Network, G.P. All rights reserved. Top \\u2002\\u2002 \\u2002\\u2002 \""},"21":{"url":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/low-cal-fettuccine-alfredo-recipe-2118317","title":"'Low-Cal Fettuccine Alfredo Recipe | Food Network Kitchen | Food Network'","content":"\"Low-Cal Fettuccine Alfredo Recipe | Food Network Kitchen | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Recipes Prev Recipe Next Recipe WATCH WATCH Loading Video... See more (12) Low-Cal Fettuccine Alfredo Recipe courtesy of Food Network Kitchen From: Food Network Magazine Recipe courtesy of Food Network Kitchen Watch how to make this recipe. From: Food Network Magazine Low-Cal Fettuccine Alfredo Getting reviews... Save Recipe Level: Easy Total: 25 min Prep: 10 min Cook: 15 min Yield: 4 servings Nutrition Info Nutritional Analysis Per Serving Calories 490 calorie Total Fat 15 grams Saturated Fat 8 grams Cholesterol 48 milligrams Sodium 734 milligrams Carbohydrates 66 grams Dietary Fiber 3 grams Protein 20 grams Share This Recipe Pinterest Facebook Twitter Email Level: Easy Total: 25 min Prep: 10 min Cook: 15 min Yield: 4 servings Nutrition Info Nutritional Analysis Per Serving Calories 490 calorie Total Fat 15 grams Saturated Fat 8 grams Cholesterol 48 milligrams Sodium 734 milligrams Carbohydrates 66 grams Dietary Fiber 3 grams Protein 20 grams Ingredients 1 tablespoon unsalted butter 1 clove garlic, minced 1 teaspoon grated lemon zest 2 teaspoons all-purpose flour 1 cup low-fat (2%) milk Kosher salt 2 tablespoons Neufchtel or low-fat cream cheese 3\/4 cup grated parmesan cheese, plus more for topping 3 tablespoons chopped fresh parsley 12 ounces fresh fettuccine Freshly ground pepper Directions WATCH Watch how to make this recipe. Make the sauce: Melt the butter in a skillet over medium heat. Add the garlic and lemon zest and cook until the garlic is slightly soft, about 1 minute. Add in the flour and cook, stirring with a wooden spoon,1 minute. Whisk in the milk and 3\/4 teaspoon salt and cook, whisking constantly, until just thickened, about 3 minutes. Add the Neufchatel and parmesan cheese; whisk until melted, about 1 minute. Stir in the chopped parsley. Meanwhile, bring a large pot of salted water to a boil. Add the fettuccine and cook until al dente, 2 to 3 minutes. Reserve 1 cup cooking water, then drain the pasta and return to the pot. Add the sauce and 1\/2 cup of the reserved cooking water to the pasta and gently toss to combine, adding more cooking water as needed to loosen. Season with salt. Divide among bowls and top with parmesan and pepper.\\xa0 Photograph by Andrew McCaul Courtesy of Food Network Magazine My Private Notes Add a Note WATCH Watch how to make this recipe. Categories: Easy Pasta Recipes Pasta Recipes Healthy Italian Alfredo Low Calorie More from: Global Flavors: Weeknights Looking for Something Else? Quick & Easy Highly Rated Healthy Surprise Me Chicken Fettuccine Alfredo Shrimp Fettuccine Alfredo Fettuccine Alfredo Chicken Fettuccine Alfredo Spring Vegetable Fettuccine Alfredo Alfredo Shrimp Scampi Dump Dinner Chicken Alfredo Stuffed Shells Pasta and Beans: Pasta e Fagioli Get the Food Network Kitchen App 👩\\u200d🍳 What's Cooking Healthy Dinners — Fast! Top Cauliflower Recipes 60+ Spring Dinners Discover More Recipes... Let's Get Cooking! To sign up, please enable JavaScript. Sign up for the Recipe of the Day newsletter to receive editor-picked recipes, tips and videos delivered to your inbox daily. Privacy Policy Sign Up Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email \""},"31":{"url":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/shrimp-fettuccine-alfredo-3364199.amp","title":"'Shrimp Fettuccine Alfredo Recipe | Food Network Kitchen | Food Network'","content":"\"Shrimp Fettuccine Alfredo Recipe | Food Network Kitchen | Food Network Watch Full Seasons Recipes Shows Chefs Restaurants Videos Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z © 2020 Television Food Network, G.P. All rights reserved. Prev Recipe Next Recipe Recipe courtesy of Food Network Kitchen Shrimp Fettuccine Alfredo 65\\xa0Reviews Level: Easy Yield: 4 servings Total: 25 min Active: 25 min Advertisement Ingredients Kosher salt 12 ounces fettuccine Olive oil, for tossing 3\/4 pound large shrimp (about 16), peeled and deveined, tails removed Freshly ground black pepper 1 stick (8 tablespoons) unsalted butter 2 cups heavy cream 2 pinches freshly grated nutmeg 1 1\/2 cups freshly grated Parmigiano-Reggiano cheese Directions Bring a large pot of water to a boil, and salt generously. Add the pasta, and boil according to package directions until al dente, tender but still slightly firm. Strain, and toss with a splash of oil. Meanwhile, arrange the shrimp in a single layer on a large pie pan or paper plate, and pat them with a paper towel until completely dry. Season with salt and pepper. Heat a large skillet over medium heat, and add 2 tablespoons of the butter. When the butter melts, raise the heat to medium-high, and invert the plate of shrimp over the skillet so the shrimp fall into the pan all at once. Cook the shrimp, without moving them, until the underside is pink, 1 to 2 minutes. Flip the shrimp, and cook until fully pink and cooked through, about 2 minutes more. Transfer the shrimp to a bowl. Reduce the heat to medium, and add the remaining 6 tablespoons butter. Scrape the bottom of the skillet with a wooden spoon to release any browned bits. When the butter has mostly melted, whisk in the cream and nutmeg and bring to a simmer, then cook for 2 minutes. Lower the heat to keep the sauce warm. Whisk the Parmigiano-Reggiano into the sauce. Add the shrimp and cooked pasta, and toss well. Season with salt and pepper. Serve hot in heated bowls. Cook’s Note Don't worry if it seems like there is too much sauce. As soon as everything is tossed together, the sauce will start to cling to the pasta and thicken before your eyes. Copyright 2015 Television Food Network, G.P. All rights reserved. Show More Categories: Alfredo Pasta Recipes Shellfish Recipes Shrimp Main Dish More from: Easy Comfort Food Recipes Let's Get Cooking! Sign up for the Recipe of the Day newsletter to receive editor-picked recipes,tips and videos delivered to your inbox daily. Privacy Policy Thanks for subscribing to the Recipe of the Day newsletter. Check out all our other great newsletters from Easy Recipes, Healthy Eating Ideas and Chef Recipe Videos. We're sorry, there was an error signing you up. Please try again later. Looking for Something Else? Chicken Fettuccine Alfredo (99) Chicken Fettuccine Alfredo (32) Low-Cal Fettuccine Alfredo (176) Alfredo Shrimp Scampi Dump Dinner (35) Spring Vegetable Fettuccine Alfredo (15) Shrimp and Grits (222) Creamy, Garlicky Shrimp Skillet (75) Shrimp Scampi (69) Advertisement 65\\xa0Reviews Anonymous Amazing! I browned a little minced garlic, And topped with parsley and few slices of shallots. Soooo good and easy!! See All Reviews Add Your Review AdChoices Privacy Newsroom © 2020 Television Food Network, G.P. All rights reserved. Top \\u2002\\u2002 \\u2002\\u2002 \""},"32":{"url":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/shrimp-fettuccine-alfredo-3364199","title":"'Shrimp Fettuccine Alfredo Recipe | Food Network Kitchen | Food Network'","content":"\"Shrimp Fettuccine Alfredo Recipe | Food Network Kitchen | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Recipes Prev Recipe Next Recipe Shrimp Fettuccine Alfredo Recipe courtesy of Food Network Kitchen Recipe courtesy of Food Network Kitchen Watch how to make this recipe. Shrimp Fettuccine Alfredo Getting reviews... This take on a classic Italian-American recipe is super easy to make. Slightly reducing the cream and adding a hefty dose of cheese means you don't have to use flour to thicken the sauce. Save Recipe Level: Easy Total: 25 min Active: 25 min Yield: 4 servings Share This Recipe Pinterest Facebook Twitter Email Level: Easy Total: 25 min Active: 25 min Yield: 4 servings Ingredients Kosher salt 12 ounces fettuccine Olive oil, for tossing 3\/4 pound large shrimp (about 16), peeled and deveined, tails removed Freshly ground black pepper 1 stick (8 tablespoons) unsalted butter 2 cups heavy cream 2 pinches freshly grated nutmeg 1 1\/2 cups freshly grated Parmigiano-Reggiano cheese Directions Bring a large pot of water to a boil, and salt generously. Add the pasta, and boil according to package directions until al dente, tender but still slightly firm. Strain, and toss with a splash of oil. Meanwhile, arrange the shrimp in a single layer on a large pie pan or paper plate, and pat them with a paper towel until completely dry. Season with salt and pepper. Heat a large skillet over medium heat, and add 2 tablespoons of the butter. When the butter melts, raise the heat to medium-high, and invert the plate of shrimp over the skillet so the shrimp fall into the pan all at once. Cook the shrimp, without moving them, until the underside is pink, 1 to 2 minutes. Flip the shrimp, and cook until fully pink and cooked through, about 2 minutes more. Transfer the shrimp to a bowl. Reduce the heat to medium, and add the remaining 6 tablespoons butter. Scrape the bottom of the skillet with a wooden spoon to release any browned bits. When the butter has mostly melted, whisk in the cream and nutmeg and bring to a simmer, then cook for 2 minutes. Lower the heat to keep the sauce warm. Whisk the Parmigiano-Reggiano into the sauce. Add the shrimp and cooked pasta, and toss well. Season with salt and pepper. Serve hot in heated bowls. Cook’s Note Don't worry if it seems like there is too much sauce. As soon as everything is tossed together, the sauce will start to cling to the pasta and thicken before your eyes. Copyright 2015 Television Food Network, G.P. All rights reserved. My Private Notes Add a Note Categories: Alfredo Pasta Recipes Shellfish Recipes Shrimp Main Dish More from: Easy Comfort Food Recipes Looking for Something Else? Quick & Easy More Fettucine Recipes 5 Ingredients or Less Highly Rated Chicken Fettuccine Alfredo Chicken Fettuccine Alfredo Low-Cal Fettuccine Alfredo Alfredo Shrimp Scampi Dump Dinner Spring Vegetable Fettuccine Alfredo Shrimp and Grits Cowboy Butter Shrimp and Grits Creamy, Garlicky Shrimp Skillet Get the Food Network Kitchen App 👩\\u200d🍳 What's Cooking Healthy Dinners — Fast! Top Cauliflower Recipes 50 Winter Meals Discover More Recipes... Let's Get Cooking! To sign up, please enable JavaScript. Sign up for the Recipe of the Day newsletter to receive editor-picked recipes, tips and videos delivered to your inbox daily. Privacy Policy Sign Up Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email \""},"33":{"url":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/caprese-chicken-penne-alfredo-5119487","title":"'Caprese Chicken Penne Alfredo Recipe | Food Network Kitchen | Food Network'","content":"\"Caprese Chicken Penne Alfredo Recipe | Food Network Kitchen | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Recipes Prev Recipe Next Recipe WATCH WATCH Loading Video... See more (12) Caprese Chicken Penne Alfredo Recipe courtesy of Food Network Kitchen Recipe courtesy of Food Network Kitchen Watch how to make this recipe. Caprese Chicken Penne Alfredo Getting reviews... Creamy Alfredo pasta meets the freshness of a caprese salad in this one-skillet dinner. Save Recipe Level: Easy Total: 1 hr (includes cooling time) Active: 30 min Yield: 6 servings Share This Recipe Pinterest Facebook Twitter Email Level: Easy Total: 1 hr (includes cooling time) Active: 30 min Yield: 6 servings Ingredients 1 pound penne pasta 8 tablespoons (1 stick) unsalted butter 2 cloves garlic, finely grated 3 cups heavy cream 2 cups finely grated Parmesan 2 cups chopped cooked white meat chicken (from 1 rotisserie chicken) Kosher salt and freshly ground black pepper 2 large red heirloom beefsteak tomatoes, sliced 1\/4 inch thick 1 pound fresh salted mozzarella, sliced 1\/4 inch thick 2 tablespoons extra-virgin olive oil 1\/2 cup torn fresh basil leaves Directions WATCH Watch how to make this recipe. Position an oven rack in the center of the oven and preheat to 350 degrees F. Cook the pasta to al dente according to the package directions. (Reserve some pasta water to add back in case the dish needs moisture.) Melt 2 tablespoons butter in a large skillet over medium-high heat and add the garlic. Cook, stirring occasionally, until very fragrant but not browned, about 1 minute. Add the cream and Parmesan and cook, stirring frequently until the mixture begins to boil, about 5 minutes. Add the chicken and cooked pasta and carefully toss to completely coat, then continue to cook until the mixture is smooth and thick, about 3 minutes. Season with salt and pepper and add the remaining 6 tablespoons butter. Carefully stir until the butter is completely melted and the sauce is glossy and creamy; remove from the heat.\\xa0 Alternating 1 slice of tomato and 1 slice of mozzarella, shingle around the outer edge of the skillet creating a ring that covers the pasta. Repeat with the remaining tomato and mozzarella forming smaller concentric rings until the pasta is completely covered. Drizzle with the olive oil, sprinkle with some salt and bake until the mozzarella is beginning to melt but the slices still hold their shape and are still white, about 20 minutes. Let cool 10 minutes, then top with the basil and serve. Copyright 2018 Television Food Network, G.P. All rights reserved. My Private Notes Add a Note WATCH Watch how to make this recipe. Categories: Pasta Recipes Chicken Recipes Poultry Main Dish Looking for Something Else? Quick & Easy More Chicken Recipes 5 Ingredients or Less Highly Rated Chicken Fettuccine Alfredo Chicken Fettuccine Alfredo Cajun Chicken Alfredo Bow-Tie Skillet Alfredo Chicken and Broccoli Fettuccine Alfredo with Homemade Fettuccine Lemon-Garlic Skillet Chicken and Potatoes Chicken Spaghetti Cajun Chicken Pasta Get the Food Network Kitchen App 👩\\u200d🍳 What's Cooking Healthy Dinners — Fast! Top Cauliflower Recipes 60+ Spring Dinners Discover More Recipes... Let's Get Cooking! To sign up, please enable JavaScript. Sign up for the Recipe of the Day newsletter to receive editor-picked recipes, tips and videos delivered to your inbox daily. Privacy Policy Sign Up Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email \""},"48":{"url":"https:\/\/www.foodnetwork.com\/recipes\/sunny-anderson\/sunnys-easy-mushroom-peas-and-pasta-with-1-2-3-alfredo-sauce-3642255","title":"\"Sunny's Easy Mushroom, Peas and Pasta with 1-2-3 Alfredo Sauce Recipe | Sunny Anderson | Food Networ\"","content":"\"Sunny's Easy Mushroom, Peas and Pasta with 1-2-3 Alfredo Sauce Recipe | Sunny Anderson | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Recipes Sunny Anderson Prev Recipe Next Recipe Sunny's Easy Mushroom, Peas and Pasta with 1-2-3 Alfredo Sauce Recipe courtesy of Sunny Anderson Recipe courtesy of Sunny Anderson Show: The Kitchen Episode: Easy Does It Sunny's Easy Mushroom, Peas and Pasta with 1-2-3 Alfredo Sauce Getting reviews... Save Recipe Level: Easy Total: 30 min Active: 20 min Yield: 4 servings Share This Recipe Pinterest Facebook Twitter Email Level: Easy Total: 30 min Active: 20 min Yield: 4 servings Ingredients Pasta: 2 tablespoons olive oil 4 fresh sage leaves\\xa0 Kosher salt and ground black pepper\\xa0 1 pound mixed wild mushrooms, sliced\\xa0 1 pound fresh fettuccine\\xa0 1 cup frozen peas (no need to defrost) 1 cup chicken stock\\xa0 1-2-3 Alfredo Sauce: 1 clove garlic, grated on a rasp 3 cups grated Pecorino Romano cheese\\xa0 2 cups heavy cream\\xa0 Directions For the pasta: In a large pan with sides and a lid, add the olive oil over medium heat. Add the sage and fry until just crisp, 2 to 3 minutes. Remove to a paper towel-lined plate and season with a tiny pinch of salt. Add the mushrooms to the pan and cook, stirring, until wilted and darkened, 5 to 8 minutes; season with salt and pepper. Add the pasta, peas and chicken stock. Cook, stirring and tossing, until all the liquid is absorbed, 1 to 2 minutes. For the 1-2-3 alfredo sauce: Add the garlic to the pan and toss, then add the cheese and heavy cream. Stir to coat everything, then cover and reduce the heat to low. Cook, covered, until the sauce has combined and thickened slightly, about 8 minutes. Top each portion with a fried sage leaf. My Private Notes Add a Note Show: The Kitchen Episode: Easy Does It Categories: Alfredo Pasta Recipes Mushroom Beans and Legumes Pea Recipes Main Dish High Fiber More from: The Kitchen Looking for Something Else? Quick & Easy More Pasta Recipes 5 Ingredients or Less Highly Rated Mushroom Risotto with Peas Italian Chicken Pasta Salad Fried Rice Retro-Metro Fancy Tuna Casserole Sunny's Easy Sausage and Mushroom Rigatoni Pie Sunny's Garlic Knots and Easy Pasta Bake Pasta, Kale and White Bean Soup Mushroom and Pea Farrotto Get the Food Network Kitchen App 👩\\u200d🍳 What's Cooking Healthy Dinners — Fast! Top Cauliflower Recipes 50 Winter Meals Discover More Recipes... Let's Get Cooking! To sign up, please enable JavaScript. Sign up for the Recipe of the Day newsletter to receive editor-picked recipes, tips and videos delivered to your inbox daily. Privacy Policy Sign Up Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email \""},"50":{"url":"https:\/\/www.foodnetwork.com\/recipes\/ree-drummond\/bow-tie-skillet-alfredo-2809410","title":"'Bow-Tie Skillet Alfredo Recipe | Ree Drummond | Food Network'","content":"\"Bow-Tie Skillet Alfredo Recipe | Ree Drummond | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Recipes Ree Drummond Prev Recipe Next Recipe WATCH WATCH Loading Video... See more (12) Bow-Tie Skillet Alfredo Recipe courtesy of Ree Drummond Recipe courtesy of Ree Drummond Show: The Pioneer Woman Episode: The Middles Bow-Tie Skillet Alfredo Getting reviews... Save Recipe Level: Easy Total: 30 min Active: 30 min Yield: 4 to 6 servings Share This Recipe Pinterest Facebook Twitter Email Level: Easy Total: 30 min Active: 30 min Yield: 4 to 6 servings Ingredients 12 ounces bow-tie pasta (farfalle) 2 boneless, skinless chicken breasts\\xa0 Salt and freshly ground black pepper 1 tablespoon butter\\xa0 1 tablespoon olive oil 2 cloves garlic, minced\\xa0 1\/2 cup low-sodium chicken broth, plus more if needed for thinning 1\/2 cup half-and-half\\xa0 1\/4 cup heavy cream\\xa0 1 cup good-quality grated Parmesan 1 cup halved grape tomatoes\\xa0 4 ounces baby spinach\\xa0 2 tablespoons fresh parsley, minced\\xa0 Directions WATCH Watch how to make this recipe. Bring a large pot of water to a boil. Cook the pasta according to the package directions. Drain and set aside. Slice the chicken into thin strips and season with salt and pepper. Heat the butter and oil in a large skillet over medium-high heat. Add the chicken strips and cook until deep golden brown on both sides and done in the middle. Remove the chicken from the skillet and add the minced garlic. Cook the garlic for 1 minute, then pour in the broth. Let it bubble up and reduce for 1 1\/2 to 2 minutes. Next, add the half-and-half, cream and some salt and pepper. Add the Parmesan, whisking constantly until it's all combined. Allow the liquid to heat up and thicken for a few minutes. If it gets too thick, you may thin it with a little chicken broth. When the sauce looks good, remove it from the heat. Return the cooked chicken to the skillet along with the grape tomatoes, spinach and pasta. Toss, taste, adjust the seasoning, top with minced parsley and serve immediately in the skillet! My Private Notes Add a Note WATCH Show: The Pioneer Woman Episode: The Middles Categories: Pasta Recipes Alfredo Spinach Parmesan Cheese Recipes Chicken Recipes Poultry Main Dish Looking for Something Else? Quick & Easy More Spinach Recipes 5 Ingredients or Less Highly Rated Cajun Chicken Alfredo Chicken and Broccoli Fettuccine Alfredo with Homemade Fettuccine Lemon-Garlic Skillet Chicken and Potatoes Parmesan Chicken Chicken Saltimbocca Spinach and Mushroom Stuffed Chicken Breasts Chicken Milanese Lemon Parmesan Chicken with Arugula Salad Topping Get the Food Network Kitchen App 👩\\u200d🍳 What's Cooking Healthy Dinners — Fast! Top Cauliflower Recipes 50 Winter Meals Discover More Recipes... Let's Get Cooking! To sign up, please enable JavaScript. Sign up for the Recipe of the Day newsletter to receive editor-picked recipes, tips and videos delivered to your inbox daily. Privacy Policy Sign Up Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email \""},"54":{"url":"https:\/\/www.foodnetwork.com\/recipes\/ellie-krieger\/fettuccine-with-walnuts-and-parsley-recipe-1953057","title":"'Fettuccine with Walnuts and Parsley Recipe | Ellie Krieger | Food Network'","content":"\"Fettuccine with Walnuts and Parsley Recipe | Ellie Krieger | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Recipes Ellie Krieger Prev Recipe Next Recipe Fettuccine with Walnuts and Parsley Recipe courtesy of Ellie Krieger Recipe courtesy of Ellie Krieger Show: Healthy Appetite with Ellie Krieger Episode: Myth Busting Fettuccine with Walnuts and Parsley Getting reviews... Save Recipe Total: 25 min Prep: 5 min Cook: 20 min Yield: 4 servings, serving size 2 1\/2 cups Nutrition Info Nutritional Analysis Per Serving Calories 617 calorie Total Fat 31 grams Saturated Fat 4.5 grams Cholesterol 1 milligrams Sodium 409 milligrams Carbohydrates 69 grams Dietary Fiber 9.5 grams Protein 16 grams Sugar 4 grams Share This Recipe Pinterest Facebook Twitter Email Total: 25 min Prep: 5 min Cook: 20 min Yield: 4 servings, serving size 2 1\/2 cups Nutrition Info Nutritional Analysis Per Serving Calories 617 calorie Total Fat 31 grams Saturated Fat 4.5 grams Cholesterol 1 milligrams Sodium 409 milligrams Carbohydrates 69 grams Dietary Fiber 9.5 grams Protein 16 grams Sugar 4 grams Ingredients 12 ounces (3\/4 box) whole-wheat fettuccine 2\/3 cup chopped toasted walnuts, 2 tablespoons reserved for garnish 1\/4 cup olive oil 5 cloves garlic, minced 1\/2 cup low-sodium chicken stock 1\/2 cup chopped parsley leaves, plus more for garnish 1\/2 teaspoon salt 1\/2 teaspoon fresh ground black pepper 1 ounce grated Parmesan (about 3\/4 cup) 2 cups arugula leaves, gently packed Directions Cook the pasta al dente according to package directions, then drain in a colander. Meanwhile, toast the walnuts in a small dry skillet over medium-high heat until fragrant, stirring frequently, 3 to 5 minutes. In the pot the pasta was cooked in, heat the olive oil over low heat, add the garlic stirring until soft and fragrant, 3 to 4 minutes (be careful not to burn it). Return the pasta to the pot, add the broth, all but 2 tablespoons of the walnuts, the parsley, salt and pepper and toss to combine, cooking over low heat for 1 to 2 minutes. Add 1\/2 cup Parmesan and toss to combine. Arrange 1\/2 cup of arugula leaves on each of 4 serving plates. Top each with about 2 cups of pasta. Sprinkle with remaining cheese, the reserved walnuts and more parsley. Serve hot. Excellent source of: Protein, Fiber, Vitamin A, Vitamin C, Vitamin K, Iron, Manganese Good source of: Folate, Copper, Magnesium, Calcium My Private Notes Add a Note Show: Healthy Appetite with Ellie Krieger Episode: Myth Busting Categories: Healthy Dinner Healthy Healthy Lunch Lunch Skillet Recipes American Pasta Recipes Nut Recipes Main Dish High Fiber More from: Healthy Food, Fast Looking for Something Else? Quick & Easy More Nuts Recipes 5 Ingredients or Less Highly Rated Chicken Fettuccine Alfredo Shrimp Fettuccine Alfredo Fettuccine Alfredo Fettuccine Alfredo Chicken Fettuccine Alfredo Easy Skillet Main Dishes 31 Photos 3-Ingredient Banana Bread Low-Cal Fettuccine Alfredo Get the Food Network Kitchen App 👩\\u200d🍳 What's Cooking Healthy Dinners — Fast! Top Cauliflower Recipes 50 Winter Meals Discover More Recipes... Let's Get Cooking! To sign up, please enable JavaScript. Sign up for the Recipe of the Day newsletter to receive editor-picked recipes, tips and videos delivered to your inbox daily. Privacy Policy Sign Up Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email \""},"55":{"url":"https:\/\/www.foodnetwork.com\/recipes\/food-network-kitchen\/creamy-cauliflower-alfredo-recipe-2105023","title":"'Creamy Cauliflower Alfredo Recipe | Food Network Kitchen | Food Network'","content":"\"Creamy Cauliflower Alfredo Recipe | Food Network Kitchen | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Recipes Prev Recipe Next Recipe Creamy Cauliflower Alfredo Recipe courtesy of Food Network Kitchen Recipe courtesy of Food Network Kitchen Watch how to make this recipe. Creamy Cauliflower Alfredo Getting reviews... The key to a tasty fettuccine alfredo is a creamy sauce. By cooking and blending cauliflower to a smooth puree, you get the creamy mouthfeel of butter and cream without the high calories and fat. Save Recipe Level: Intermediate Total: 1 hr Prep: 25 min Cook: 35 min Yield: 4 servings Nutrition Info Nutritional Analysis Per Serving Calories 324 Total Fat 7 grams Saturated Fat 3.5 grams Cholesterol 17 milligrams Sodium 326 milligrams Carbohydrates 53 grams Dietary Fiber 10 grams Protein 16 grams Share This Recipe Pinterest Facebook Twitter Email Level: Intermediate Total: 1 hr Prep: 25 min Cook: 35 min Yield: 4 servings Nutrition Info Nutritional Analysis Per Serving Calories 324 Total Fat 7 grams Saturated Fat 3.5 grams Cholesterol 17 milligrams Sodium 326 milligrams Carbohydrates 53 grams Dietary Fiber 10 grams Protein 16 grams Ingredients 2 cups cauliflower florets, about 8-ounces 1 cup low-sodium chicken broth 8 ounces whole grain fettuccine pasta 1 teaspoon extra-virgin olive oil 2 cloves garlic, minced 1\/2 cup low-fat evaporated milk Kosher salt and freshly ground pepper 3\/4 cup frozen petite peas, thawed, (4 ounces) 1\/4 cup grated Parmesan cheese 1 tablespoon unsalted butter 1 tablespoon chopped fresh parsley, plus extra for garnish 1 1\/2 teaspoons finely grated lemon zest Directions 1. Put the cauliflower, broth, and 1 cup water in a small pot; bring to a boil over medium-high heat. Adjust the heat to maintain a simmer and cook until the cauliflower is very soft, 25 to 30 minutes. Remove from the heat and cool 5 minutes. Carefully puree cauliflower and all the liquid in a blender until very smooth; set aside. 2. Meanwhile, bring a large pot of salted water to a boil and cook the pasta until al dente, 8 minutes. Drain well, reserving about 1 cup pasta cooking water. 3. Heat the oil in a large skillet over medium heat. Add the garlic and cook until fragrant, about 30 seconds. Add the cauliflower puree and evaporated milk and bring to a simmer. Cook until slightly thickened, 5 minutes and season with salt and pepper. Stir in the peas until heated through, 2 minutes. Toss in the cooked pasta, Parmesan cheese and about 1\/2 cup of pasta water until the noodles are coated but the sauce is still loose. Remove from the heat and toss in the butter, chopped parsley and lemon zest. (If the sauce seems thick, adjust the consistency with the remaining pasta water). Serve immediately sprinkled with chopped parsley. Copyright 2010 Television Food Network, G.P. All rights reserved My Private Notes Add a Note Categories: Healthy Pasta Recipes Cauliflower Parmesan Cheese Recipes More from: Healthy Weeknight Dinners Looking for Something Else? Quick & Easy Highly Rated Healthy Surprise Me Cauliflower Alfredo Sauce Cauliflower Gratin Roasted Cauliflower Lasagna Cauliflower Pizza Crust Bow-Tie Skillet Alfredo Parmesan-Roasted Cauliflower Cauliflower Parmesan Creamy Garlic Mashed Potatoes Get the Food Network Kitchen App 👩\\u200d🍳 What's Cooking Healthy Dinners — Fast! Top Cauliflower Recipes 60+ Spring Dinners Discover More Recipes... Let's Get Cooking! To sign up, please enable JavaScript. Sign up for the Recipe of the Day newsletter to receive editor-picked recipes, tips and videos delivered to your inbox daily. Privacy Policy Sign Up Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email \""},"56":{"url":"https:\/\/www.foodnetwork.com\/recipes\/guy-fieri\/cajun-chicken-alfredo-2-recipe-2095695","title":"'Cajun Chicken Alfredo 2 Recipe | Guy Fieri | Food Network'","content":"\"Cajun Chicken Alfredo 2 Recipe | Guy Fieri | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Recipes Guy Fieri Prev Recipe Next Recipe Cajun Chicken Alfredo 2 Recipe courtesy of Guy Fieri Recipe courtesy of Guy Fieri Show: The Best Thing I Ever Made Episode: The Sure Thing Cajun Chicken Alfredo 2 Getting reviews... Save Recipe Level: Easy Total: 45 min Prep: 20 min Cook: 25 min Yield: 4 servings Share This Recipe Pinterest Facebook Twitter Email Level: Easy Total: 45 min Prep: 20 min Cook: 25 min Yield: 4 servings Ingredients Kosher salt Four 5-ounce boneless, skinless chicken breasts (about 1 1\/4 pounds) Blackening Spice Rub, recipe follows 2 tablespoons olive oil 3 tablespoons minced garlic 1\/4 cup dry white wine 3 cups heavy cream 1 cup roughly chopped marinated sun-dried tomatoes 1 pound fettuccine 3\/4 cup grated Parmesan 1 teaspoon fine sea salt 1 teaspoon freshly ground black pepper 1\/2 cup thinly sliced green onion, for garnish Blackening Spice Rub: 1 tablespoon granulated garlic 1 tablespoon freshly cracked black pepper 1\/2 tablespoon salt 2 teaspoons ground cumin 2 teaspoons granulated onion 1 teaspoon cayenne pepper 1 teaspoon Italian seasoning 1 teaspoon paprika 1\/2 teaspoon chili powder Directions Preheat the oven to 350 degrees F. Bring a large pot of salted water to a boil. Heat a large cast-iron skillet over very high heat.\\xa0 Dredge the chicken breasts in the Blackening Spice Rub. Place in the cast-iron skillet. Blacken both sides of the chicken, 2 to 3 minutes per side.\\xa0 Transfer the chicken to a baking sheet and place in the oven until the internal temperature of the chicken reaches 165 degrees F on an instant-read thermometer, about 10 minutes.\\xa0 Remove from the oven and slice the chicken into strips on the bias.\\xa0 In a large skillet over medium heat, heat the olive oil. Add the garlic and lightly brown it, 2 to 3 minutes. Stir in the wine. Pour in the heavy cream, bring to a simmer and cook until the sauce is reduced by half. Add the sun-dried tomatoes and chicken slices.\\xa0 Meanwhile, cook the fettuccine al dente, according to the package directions. Drain.\\xa0 When the cream sauce is at the desired consistency, stir in 1\/2 cup of the Parmesan, the sea salt, pepper and pasta.\\xa0 To serve, toss the pasta with the cream sauce and serve on large rimmed plates. Garnish with the green onions and the remaining 1\/4 cup Parmesan. Blackening Spice Rub: Combine the garlic, black pepper, salt cumin, onion, cayenne pepper, Italian seasoning, paprika and chili powder in a small bowl. Store in an airtight container. My Private Notes Add a Note Show: The Best Thing I Ever Made Episode: The Sure Thing Categories: American Cajun Alfredo Chicken Recipes Poultry Main Dish More from: Spicy Foods Looking for Something Else? Quick & Easy More Chicken Recipes 5 Ingredients or Less Highly Rated Cajun Chicken Alfredo Perfect Roast Chicken Our Best Chicken Thigh Recipes 42 Photos Air Fryer Chicken Wings Chicken Enchiladas Chicken Piccata Fried Chicken Chicken Fettuccine Alfredo Get the Food Network Kitchen App 👩\\u200d🍳 What's Cooking Healthy Dinners — Fast! Top Cauliflower Recipes 50 Winter Meals Discover More Recipes... Let's Get Cooking! To sign up, please enable JavaScript. Sign up for the Recipe of the Day newsletter to receive editor-picked recipes, tips and videos delivered to your inbox daily. Privacy Policy Sign Up Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email \""},"60":{"url":"https:\/\/www.foodnetwork.com\/recipes\/valerie-bertinelli\/chicken-and-broccoli-fettuccine-alfredo-with-homemade-fettuccine-3864846","title":"'Chicken and Broccoli Fettuccine Alfredo with Homemade Fettuccine Recipe | Valerie Bertinelli | Food '","content":"\"Chicken and Broccoli Fettuccine Alfredo with Homemade Fettuccine Recipe | Valerie Bertinelli | Food Network Magazine App Saves Artboard (1) Created with Sketch. Food Network Kitchen Recipes Healthy Comfort Food Shop Shows Chefs Schedule Watch Full Seasons Recipes Shows Chefs Restaurants Videos Magazine App Newsletters Sweeps TV Schedule Blog Food Network Kitchen App Shop Shows A-Z Chefs A-Z Log Out Log In Sign Up © 2020 Television Food Network, G.P. All rights reserved. Home Recipes Valerie Bertinelli Prev Recipe Next Recipe WATCH WATCH Loading Video... See more (12) Chicken and Broccoli Fettuccine Alfredo with Homemade Fettuccine Recipe courtesy of Valerie Bertinelli Recipe courtesy of Valerie Bertinelli Show: Valerie's Home Cooking Episode: Be Prepared! Chicken and Broccoli Fettuccine Alfredo with Homemade Fettuccine Getting reviews... Save Recipe Level: Easy Total: 3 hr 40 min (includes resting time) Active: 1 hr 25 min Yield: 4 to 6 servings Share This Recipe Pinterest Facebook Twitter Email Level: Easy Total: 3 hr 40 min (includes resting time) Active: 1 hr 25 min Yield: 4 to 6 servings Ingredients Homemade Fettuccine: 1 1\/2 cups plus 3 tablespoons all-purpose flour (about 8 ounces), plus extra if needed 1\/2 teaspoon kosher salt\\xa0 3 large eggs\\xa0plus 2 yolks\\xa0 Chicken and Broccoli Alfredo: 1 pound broccoli florets, large pieces cut in half or quartered 4 tablespoons extra-virgin olive oil 2 teaspoons lemon zest (2 lemons) Kosher salt and freshly ground black pepper 2 tablespoons unsalted butter\\xa0 1 1\/4 to 1 1\/2 pounds boneless, skinless chicken breasts (3 small breasts)\\xa0 1 tablespoon minced garlic (4 cloves)\\xa0 3 tablespoons all-purpose flour\\xa0 4 cups half-and-half\\xa0 1 cup shredded Asiago cheese 1 cup shredded Parmesan\\xa0 2 tablespoons fresh lemon juice (1 lemon)\\xa0 2 tablespoons chopped fresh parsley\\xa0 Directions WATCH Watch how to make this recipe. For the homemade fettuccine: Combine the flour and salt in a stand mixer fitted with the dough hook. Add the eggs and yolks and mix on medium speed. Turn the mixer off and scrape down the sides of the bowl, pushing the flour towards the center. Continue to mix on medium speed, repeating these steps until the dough comes together into a ball. If the dough sticks to the sides of the bowl, add flour, 1 tablespoon at a time, until it forms a cohesive ball. Knead the dough on medium-high for 3 to 4 minutes. When the dough is smooth, bright yellow in color and bounces back when pressed, transfer it to a lightly floured work surface. Knead by hand a few more times and then form into a ball. The dough should feel moist but not sticky; knead in more flour, 1 tablespoon at a time, as necessary. Wrap the dough in plastic wrap and refrigerate for at least 2 hours but no more than 4 hours. Fit the stand mixer with the pasta roller attachment and set to the widest setting (No. 1). Position the stand mixer with 2 to 3 feet of counter space to the left. Remove the dough from the refrigerator and divide into three portions. Work with one piece of dough at time, keeping the rest under plastic wrap so it doesn't dry out. With your fingers, press a portion of the dough into a roughly 5-by-2 1\/2-inch rectangle. Dust lightly with flour on both sides. Turn the mixer onto low speed and feed the dough through the roller with the 2 1\/2-inch parallel to the roller. Next, fold the two ends of the dough into the center so they just meet and then fold one half over the other so the dough closes like a book; this is called laminating the dough. Use your fingers to seal the two edges together, then once again shape the dough into a 5-by-2 1\/2-inch rectangle. Dust the dough with flour and feed it through the roller a second time. Repeat by laminating the dough one more time and feeding it through the roller. Dust with flour and feed through the roller three more times, dust with more flour as needed. Adjust the roller to setting No. 3 and feed the dough through the roller twice. Adjust to setting No. 5 and feed the dough through two more times. At this point the dough will be over a foot long. Use your right hand to feed the dough through the roller and your left hand to catch the dough. Always be very gentle with the dough to prevent tearing. Be sure to feed the dough through the machine so that it does not fold onto itself. You can make small adjustments to how the dough is entering the roller by gently guiding it to the left or right. If the dough is too long to handle, simply cut it in half and work with a smaller portion. Finally, adjust the roller to setting No. 7 and feed the dough through another two times. After the dough has gone through the roller for the last time, dust it all over with flour and then fold it over itself and hold under a piece of plastic wrap. Repeat these steps with the remaining two pieces of dough. Replace the roller attachment with the fettucine cutter attachment. Dust a baking sheet with flour. Cut the rolled dough into 12-inch pieces and feed through the fettucine cutter on low speed. Twist the fettucine into a nest and place on the prepared baking sheet. Cover with plastic wrap while you cut the remaining dough. Lightly dust the tops of the fettucine nests with flour, cover with slightly dampened paper towel and then with plastic wrap. Hold at room temperature for no more than an hour or the pasta will dry out. (Makes 1 pound pasta dough.) For the chicken and broccoli alfredo: Place a baking sheet in the oven and preheat the oven to 450 degrees F. Mix the broccoli florets with 2 tablespoons of the olive oil, 1 teaspoon of the lemon zest, and salt and pepper to taste. Add the broccoli to the preheated baking sheet and roast until the lightly charred and tender, 18 minutes. Remove from the oven and let cool. Bring a large pot of water to a boil. Season with salt so that the water tastes like the ocean. Heat a 12-inch, high-sided pan over medium heat. Add the butter and the remaining 2 tablespoons olive oil. Sprinkle the chicken breasts with salt and pepper. When the butter is melted, add the chicken and cook until browned and cooked through, 4 to 5 minutes per side. If the chicken has browned on both sides but isn't cooked through yet, remove to a baking sheet and finish in the oven. Let cool and then cut into 1\/2-inch pieces. To the same pan, add the minced garlic; cook until fragrant, 1 minute. Add the flour and stir to combine, scraping up the dark bits from the bottom of the pan. Whisk in 1 cup of the half-and-half, making sure the flour is completely combined, without any lumps. Whisk in the remaining 3 cups half-and-half, bring to a boil and cook for 3 to 4 minutes. When the mixture has thickened around the edges, but before your whisk leaves a trail behind it, add the remaining 1 teaspoon lemon zest and the Asiago and Parmesan, and whisk to combine. Turn the heat to low and season with salt and pepper. The sauce should have the consistency of a thick soup. If the sauce thickens too much, add a little of the pasta water to thin it out. Add the chicken and broccoli to the cheese sauce and hold over low heat. Meanwhile, cook to the pasta: Separate the strands of pasta on the baking sheet and add them to the boiling water. Cook for 30 seconds, or until the pasta floats to the top. Drain and add to the cheese sauce. Add the lemon juice and toss to combine. Garnish with parsley and serve immediately. My Private Notes Add a Note WATCH Show: Valerie's Home Cooking Episode: Be Prepared! Categories: Pasta Recipes Alfredo Chicken Recipes Poultry Broccoli Main Dish Looking for Something Else? Quick & Easy More Chicken Recipes 5 Ingredients or Less Highly Rated Chicken Fettuccine Alfredo Chicken Fettuccine Alfredo Cajun Chicken Alfredo Bow-Tie Skillet Alfredo Chicken Broccoli Casserole Chicken Stir-Fry Chicken and Broccoli Stir-Fry Chicken, Broccoli and Cheese Casserole Get the Food Network Kitchen App 👩\\u200d🍳 What's Cooking Healthy Dinners — Fast! Top Cauliflower Recipes 60+ Spring Dinners Discover More Recipes... Let's Get Cooking! To sign up, please enable JavaScript. Sign up for the Recipe of the Day newsletter to receive editor-picked recipes, tips and videos delivered to your inbox daily. Privacy Policy Sign Up Site Map Visitor Agreement AdChoices Privacy Policy About Newsroom Advertise Help TV Ratings Online Closed Captioning California Do Not Sell My Info Discovery, Inc. International Editions United States Asia Brazil Canada Europe, Middle East & Africa United Kingdom Latin America See all Scripps Networks Digital Cooking Channel Food.com HGTV DIY Network Travel Channel Great American Country © 2020 Television Food Network, G.P. All rights reserved. Pinterest Facebook Twitter Email \""}}